kochaika/T8-7X-thread-proxy/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# Device identification (test vendor ID works with Apple/Google Home)
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8002

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# The DMX frame task paces itself with vTaskDelay(1). At the 100 Hz default that is a
# 10 ms gap (~31 fps) and a visibly coarse Identify blink; 1 kHz gives the ~42 fps the
# original sketch ran at.
CONFIG_FREERTOS_HZ=1000

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Build Matter OTA image (creates .ota file alongside .bin)
# CONFIG_CHIP_OTA_IMAGE_BUILD=y

# Disable STA and AP for ESP32C6
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=n

# Console on native USB. The remaining ESP_CONSOLE_* symbols derive from this one.
# UART0 is left free and UART1 is the DMX transmitter.
#CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Exclude unused clusters to optimize flash and memory usage
# Note: this device is an Extended Color Light, so both of these must stay enabled.
CONFIG_SUPPORT_LEVEL_CONTROL_CLUSTER=y
CONFIG_SUPPORT_COLOR_CONTROL_CLUSTER=y
